Revit 2024 API
Application.NewElementId Method
Creates a new Autodesk::Revit::DB::ElementId^ object.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public ElementId NewElementId()
Visual Basic
Public Function NewElementId As ElementId
Visual C++
public:
ElementId^ NewElementId()
Return Value
The new Autodesk::Revit::DB::ElementId^ object.
See Also
Application Class
Autodesk.Revit.Creation Namespace